In [1]:
import pandas as pd

In [2]:
# Datatype: i) series ii) dataframe

In [5]:
# series: 1-D
# Note: series 'S' should be capital

series = pd.Series(['BMW','Toyota','Honda'])

In [6]:
series

0       BMW
1    Toyota
2     Honda
dtype: object

In [9]:
colors = pd.Series(['Red','Blue','White'])

In [10]:
colors

0      Red
1     Blue
2    White
dtype: object

In [13]:
# # dataframe: 2-D

car_data = pd.DataFrame({'Brand':series,'Color':colors})

In [14]:
car_data

    Brand  Color
0     BMW    Red
1  Toyota   Blue
2   Honda  White

In [23]:
# Importing file
car_sales = pd.read_csv('car-sales.csv')

In [24]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [41]:
# Exporting File
car_sales.to_csv('exported-car-sales.csv')

In [43]:
car_sales.to_csv('exported-car-sales.csv',index=False)

In [44]:
# note: var_name should be in "_" not '-'
exported_car_sales = pd.read_csv("exported-car-sales.csv")
exported_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00